geosmall/Arduino_UVOS_STM32/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Flight Controller boards

Flight_ctrl.name=Flight Controllers

Flight_ctrl.build.core=arduino
Flight_ctrl.build.board=Flight_ctrl
Flight_ctrl.build.variant_h=variant_{build.board}.h
Flight_ctrl.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Flight_ctrl.upload.maximum_size=0
Flight_ctrl.upload.maximum_data_size=0

# FC_REVO_F405RG board
Flight_ctrl.menu.pnum.FC_REVO_F405RG=Revo F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.node="NODE_F405RG,REVO"
Flight_ctrl.menu.pnum.FC_REVO_F405RG.upload.maximum_size=1048576
Flight_ctrl.menu.pnum.FC_REVO_F405RG.upload.maximum_data_size=131072
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.mcu=cortex-m4
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.fpu=-mfpu=fpv4-sp-d16
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.float-abi=-mfloat-abi=hard
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.board=FC_REVO_F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.series=STM32F4xx
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.product_line=STM32F405xx
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.variant=STM32F4xx/FC_Revo_F405RG
Flight_ctrl.menu.pnum.FC_REVO_F405RG.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Flight_ctrl.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Flight_ctrl.menu.upload_method.swdMethod.upload.protocol=0
Flight_ctrl.menu.upload_method.swdMethod.upload.options=-g
Flight_ctrl.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Flight_ctrl.menu.upload_method.serialMethod.upload.protocol=1
Flight_ctrl.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Flight_ctrl.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Flight_ctrl.menu.upload_method.dfuMethod.upload.protocol=2
Flight_ctrl.menu.upload_method.dfuMethod.upload.options=-g
Flight_ctrl.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

Flight_ctrl.menu.upload_method.clipboard=Clipboard (Copy Path)
Flight_ctrl.menu.upload_method.clipboard.upload.protocol=0
Flight_ctrl.menu.upload_method.clipboard.upload.options=-g
Flight_ctrl.menu.upload_method.clipboard.upload.tool=clipboard_upload

################################################################################
# Dev boards

Dev_boards.name=Development Boards

Dev_boards.build.core=arduino
Dev_boards.build.board=Dev_boards
Dev_boards.build.variant_h=variant_{build.board}.h
Dev_boards.build.st_extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
Dev_boards.upload.maximum_size=0
Dev_boards.upload.maximum_data_size=0

# BlackPill F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC=BlackPill F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.node="NODE_F401CC,BlkPill"
Dev_boards.menu.pnum.BLACKPILL_F401CC.upload.maximum_size=262144
Dev_boards.menu.pnum.BLACKPILL_F401CC.upload.maximum_data_size=65536
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.mcu=cortex-m4
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.fpu=-mfpu=fpv4-sp-d16
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.board=BLACKPILL_F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.series=STM32F4xx
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.product_line=STM32F401xC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.variant=STM32F4xx/Dev_Blackpill_F401CC
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.variant_h=variant_BLACKPILL_F401Cx.h
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.cmsis_lib_gcc=arm_cortexM4lf_math
Dev_boards.menu.pnum.BLACKPILL_F401CC.build.st_extra_flags=-DHSE_VALUE=25000000U -D{build.product_line} {build.enable_usb} {build.xSerial}

# BlackPill F411CE
Dev_boards.menu.pnum.BLACKPILL_F411CE=BlackPill F411CE
Dev_boards.menu.pnum.BLACKPILL_F411CE.node="NODE_F411CE,BlkPill"
Dev_boards.menu.pnum.BLACKPILL_F411CE.upload.maximum_size=524288
Dev_boards.menu.pnum.BLACKPILL_F411CE.upload.maximum_data_size=131072
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.mcu=cortex-m4
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.fpu=-mfpu=fpv4-sp-d16
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.board=BLACKPILL_F411CE
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.series=STM32F4xx
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.product_line=STM32F411xE
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.variant=STM32F4xx/Dev_Blackpill_F411CE
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.variant_h=variant_BLACKPILL_F411CE.h
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.cmsis_lib_gcc=arm_cortexM4lf_math
Dev_boards.menu.pnum.BLACKPILL_F411CE.build.st_extra_flags=-DHSE_VALUE=8000000U -D{build.product_line} {build.enable_usb} {build.xSerial}

# DevEBoxH743VITX
Dev_boards.menu.pnum.DevEBoxH743VITX=DevEBox H743VITX
Dev_boards.menu.pnum.DevEBoxH743VITX.node="NODE_H743VI,DevEBox"
Dev_boards.menu.pnum.DevEBoxH743VITX.upload.maximum_size=2097152
Dev_boards.menu.pnum.DevEBoxH743VITX.upload.maximum_data_size=524288
Dev_boards.menu.pnum.DevEBoxH743VITX.build.mcu=cortex-m7
Dev_boards.menu.pnum.DevEBoxH743VITX.build.fpu=-mfpu=fpv4-sp-d16
Dev_boards.menu.pnum.DevEBoxH743VITX.build.float-abi=-mfloat-abi=hard
Dev_boards.menu.pnum.DevEBoxH743VITX.build.board=DevEBoxH743VITX
Dev_boards.menu.pnum.DevEBoxH743VITX.build.series=STM32H7xx
Dev_boards.menu.pnum.DevEBoxH743VITX.build.product_line=STM32H743xx
Dev_boards.menu.pnum.DevEBoxH743VITX.build.variant=STM32H7xx/Dev_DevEBoxH7xx
Dev_boards.menu.pnum.DevEBoxH743VITX.build.variant_h=variant_DevEBoxH7xx.h
Dev_boards.menu.pnum.DevEBoxH743VITX.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
Dev_boards.menu.pnum.DevEBoxH743VITX.build.st_extra_flags=-DCORE_CM7 -DHSE_VALUE=25000000U -D{build.product_line} {build.enable_usb} {build.xSerial}

# Upload menu
Dev_boards.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Dev_boards.menu.upload_method.swdMethod.upload.protocol=0
Dev_boards.menu.upload_method.swdMethod.upload.options=-g
Dev_boards.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

