geosmall/Arduino_UVOS_STM32/boards.txt
Nucleo_64.menu.xserial.generic=Enabled (generic 'Serial')
Nucleo_64.menu.xserial.none=Enabled (no generic 'Serial')
Nucleo_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Nucleo_64.menu.xserial.disabled=Disabled (No Serial support)
Nucleo_64.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled (generic 'Serial')
Disco.menu.xserial.none=Enabled (no generic 'Serial')
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (no Serial support)
Disco.menu.xserial.disabled.build.xSerial=

# USB connectivity
Flight_ctrl.menu.usb.none=None
Flight_ctrl.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Flight_ctrl.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Flight_ctrl.menu.usb.CDC=CDC (no generic 'Serial')
Flight_ctrl.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Flight_ctrl.menu.xusb.FS=Low/Full Speed
Flight_ctrl.menu.xusb.HS=High Speed
Flight_ctrl.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Flight_ctrl.menu.xusb.HSFS=High Speed in Full Speed mode
Flight_ctrl.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

Dev_boards.menu.usb.none=None
Dev_boards.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Dev_boards.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Dev_boards.menu.usb.CDC=CDC (no generic 'Serial')
Dev_boards.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Dev_boards.menu.xusb.FS=Low/Full Speed
Dev_boards.menu.xusb.HS=High Speed
Dev_boards.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Dev_boards.menu.xusb.HSFS=High Speed in Full Speed mode
Dev_boards.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

Nucleo_64.menu.usb.none=None
Nucleo_64.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Nucleo_64.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Nucleo_64.menu.usb.CDC=CDC (no generic 'Serial')
Nucleo_64.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Nucleo_64.menu.xusb.FS=Low/Full Speed
Nucleo_64.menu.xusb.HS=High Speed
Nucleo_64.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Nucleo_64.menu.xusb.HSFS=High Speed in Full Speed mode
Nucleo_64.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

Disco.menu.usb.none=None
Disco.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
Disco.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
Disco.menu.usb.CDC=CDC (no generic 'Serial')
Disco.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
Disco.menu.xusb.FS=Low/Full Speed
Disco.menu.xusb.HS=High Speed
Disco.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
Disco.menu.xusb.HSFS=High Speed in Full Speed mode
Disco.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
Flight_ctrl.menu.opt.ogstd=Debug (-Og)
Flight_ctrl.menu.opt.ogstd.build.flags.optimize=-Og
Flight_ctrl.menu.opt.osstd=Smallest (-Os default)
Flight_ctrl.menu.opt.oslto=Smallest (-Os) with LTO
Flight_ctrl.menu.opt.oslto.build.flags.optimize=-Os -flto
Flight_ctrl.menu.opt.o1std=Fast (-O1)
Flight_ctrl.menu.opt.o1std.build.flags.optimize=-O1
Flight_ctrl.menu.opt.o1lto=Fast (-O1) with LTO
Flight_ctrl.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Flight_ctrl.menu.opt.o2std=Faster (-O2)
Flight_ctrl.menu.opt.o2std.build.flags.optimize=-O2
Flight_ctrl.menu.opt.o2lto=Faster (-O2) with LTO
Flight_ctrl.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Flight_ctrl.menu.opt.o3std=Fastest (-O3)
Flight_ctrl.menu.opt.o3std.build.flags.optimize=-O3
Flight_ctrl.menu.opt.o3lto=Fastest (-O3) with LTO
Flight_ctrl.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Flight_ctrl.menu.opt.o0std=No Optimization (-O0)
Flight_ctrl.menu.opt.o0std.build.flags.optimize=-O0

Dev_boards.menu.opt.ogstd=Debug (-Og)
Dev_boards.menu.opt.ogstd.build.flags.optimize=-Og
Dev_boards.menu.opt.osstd=Smallest (-Os default)
Dev_boards.menu.opt.oslto=Smallest (-Os) with LTO
Dev_boards.menu.opt.oslto.build.flags.optimize=-Os -flto
Dev_boards.menu.opt.o1std=Fast (-O1)
Dev_boards.menu.opt.o1std.build.flags.optimize=-O1
Dev_boards.menu.opt.o1lto=Fast (-O1) with LTO
Dev_boards.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Dev_boards.menu.opt.o2std=Faster (-O2)
Dev_boards.menu.opt.o2std.build.flags.optimize=-O2
Dev_boards.menu.opt.o2lto=Faster (-O2) with LTO
Dev_boards.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Dev_boards.menu.opt.o3std=Fastest (-O3)
Dev_boards.menu.opt.o3std.build.flags.optimize=-O3
Dev_boards.menu.opt.o3lto=Fastest (-O3) with LTO
Dev_boards.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Dev_boards.menu.opt.o0std=No Optimization (-O0)
Dev_boards.menu.opt.o0std.build.flags.optimize=-O0

Nucleo_64.menu.opt.ogstd=Debug (-Og)
Nucleo_64.menu.opt.ogstd.build.flags.optimize=-Og
Nucleo_64.menu.opt.osstd=Smallest (-Os default)
Nucleo_64.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_64.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_64.menu.opt.o1std=Fast (-O1)
Nucleo_64.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_64.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_64.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_64.menu.opt.o2std=Faster (-O2)
Nucleo_64.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_64.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_64.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_64.menu.opt.o3std=Fastest (-O3)
Nucleo_64.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_64.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_64.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Nucleo_64.menu.opt.o0std=No Optimization (-O0)
Nucleo_64.menu.opt.o0std.build.flags.optimize=-O0

Disco.menu.opt.ogstd=Debug (-Og)
Disco.menu.opt.ogstd.build.flags.optimize=-Og
Disco.menu.opt.osstd=Smallest (-Os default)
Disco.menu.opt.oslto=Smallest (-Os) with LTO
Disco.menu.opt.oslto.build.flags.optimize=-Os -flto
Disco.menu.opt.o1std=Fast (-O1)
Disco.menu.opt.o1std.build.flags.optimize=-O1
Disco.menu.opt.o1lto=Fast (-O1) with LTO
Disco.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Disco.menu.opt.o2std=Faster (-O2)
Disco.menu.opt.o2std.build.flags.optimize=-O2
Disco.menu.opt.o2lto=Faster (-O2) with LTO
Disco.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Disco.menu.opt.o3std=Fastest (-O3)
Disco.menu.opt.o3std.build.flags.optimize=-O3
Disco.menu.opt.o3lto=Fastest (-O3) with LTO
Disco.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Disco.menu.opt.o0std=No Optimization (-O0)
Disco.menu.opt.o0std.build.flags.optimize=-O0

# Debug information
Flight_ctrl.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
Flight_ctrl.menu.dbg.enable_all.build.flags.debug=-g
Flight_ctrl.menu.dbg.none=None
Flight_ctrl.menu.dbg.enable_sym=Symbols Enabled (-g)
Flight_ctrl.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
Flight_ctrl.menu.dbg.enable_log=Core logs Enabled
Flight_ctrl.menu.dbg.enable_log.build.flags.debug=

